Tekla.Structures.ModelInternal.Operation.ExportModel(System.String,System.String,System.String,System.String,System.String,System.Boolean,Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t)
Exports TS model to file.
outPath: Output file name and path.
basePointGuid:
basePointExportType:
exportType:
propertiesPath:
selectedOnly:
info:
Returns: True, if success.

Tekla.Structures.ModelInternal.Operation.GetDeletedSubmittedPartsCount
Retrieves the number of deleted parts that were previously submitted to procurement.

Tekla.Structures.ModelInternal.Operation.SendABMNumbering(System.Boolean,System.String,System.String@,System.String@)
Calls the send functionality in the ABM numbering.
selectedModelObjectsOnly: Flag that indicates if all parts from the model or just the selected ones needs to be sent.
propertiesPath: The property set file path.
changesFilePath: The path to the changes trim bim file.
allHistoryFilePath: The path to the all history trim bim file.
Returns: True if the send in the ABM numbering was successful.